# RoofArea_HeatedProj

## Description
Returns the heated (interior) area projected on the ground plane of roofs or roof faces that meet the criteria.

```pascal
FUNCTION RoofArea_HeatedProj(c : CRITERIA) : REAL;
```

```python

def vs.RoofArea_HeatedProj(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA||

## Version
Availability: from Vectorworks 2009
## Category
* Criteria